
#### :building_construction: Terraform Plan
```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tenant["freifunk-troisdorf-126b9c8"].netbox_device.router[0] has changed
  ~ resource "netbox_device" "router" {
      ~ config_template_id       = 0 -> 1
        id                       = "681"
        name                     = "ext-freifunk-troisdorf-126b9c8"
      ~ primary_ipv4             = 0 -> 972
      ~ primary_ipv6             = 0 -> 990
      + tags                     = []
        # (21 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.tenant["freifunk-troisdorf-126b9c8"].netbox_device.router[0] will be updated in-place
  ~ resource "netbox_device" "router" {
      - config_template_id       = 1 -> null
        id                       = "681"
        name                     = "ext-freifunk-troisdorf-126b9c8"
      ~ platform_id              = 0 -> 1
        tags                     = []
        # (22 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "677"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "955"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "946"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "681"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ device_interface_id   = 2363 -> (known after apply)
        id                    = "972"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ device_interface_id   = 2363 -> (known after apply)
        id                    = "990"
        tags                  = []
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```